2016/brp 2016-02-09/art/art-data/resources/resources/RequestTemplates/KUC042-HuwelijkNederland_request_template.xml

<?xml version="1.0" encoding="UTF-8"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
	<soapenv:Header>${DataSource Values#Header_EEE0}</soapenv:Header>
	<soapenv:Body>
		<brp:bhg_hgpRegistreerHuwelijkGeregistreerdPartnerschap xmlns:brp="http://www.bzk.nl/brp/brp0200">
			<brp:stuurgegevens brp:communicatieID="comid.stuurgegevens00B">
				<brp:zendendePartij>${DataSource Values#zendendePartij_zsH0}</brp:zendendePartij>
				<brp:zendendeSysteem>${DataSource Values#zendendeSysteem_zsH0}</brp:zendendeSysteem>
				<brp:referentienummer>${DataSource Values#referentienummer_sHB0}</brp:referentienummer>
				<brp:tijdstipVerzending>[moment_volgen]</brp:tijdstipVerzending>
			</brp:stuurgegevens>
			<brp:parameters brp:communicatieID="id.parameters0">
				<brp:verwerkingswijze>${DataSource Values#verwerkingswijze_pHB0}</brp:verwerkingswijze>
			</brp:parameters>
			<brp:voltrekkingHuwelijkInNederland
                                       brp:communicatieID="id.voltrekkingHuwelijkInNederland0"
                                       brp:objecttype="AdministratieveHandeling">
				<brp:partijCode>${DataSource Values#partijCode_sHB0}</brp:partijCode>
				<!--<brp:tijdstipOntlening>${DataSource Values#tijdstipOntlening_sHB0}</brp:tijdstipOntlening>-->
				<brp:toelichtingOntlening>${DataSource Values#toelichtingOntlening_sHB0}</brp:toelichtingOntlening>
				<brp:gedeblokkeerdeMeldingen>
					<brp:gedeblokkeerdeMelding brp:communicatieID="id.gedeblokkeerdeMelding0"
                                         brp:objecttype="GedeblokkeerdeMelding"
                                         brp:referentieID="${DataSource Values#|gedeblokkeerdeMelding1|}">
						<brp:regelCode>${DataSource Values#regelCode_ggs0}</brp:regelCode>
						<!--<brp:attribuutNaam>${DataSource Values#attribuutNaam_ggs0}</brp:attribuutNaam>-->
					</brp:gedeblokkeerdeMelding>
					<brp:gedeblokkeerdeMelding brp:communicatieID="id.gedeblokkeerdeMelding1"
                                         brp:objecttype="GedeblokkeerdeMelding"
                                         brp:referentieID="${DataSource Values#|gedeblokkeerdeMelding2|}">
						<brp:regelCode>${DataSource Values#regelCode_ggs1}</brp:regelCode>
						<!--<brp:attribuutNaam>${DataSource Values#attribuutNaam_ggs1}</brp:attribuutNaam>-->
					</brp:gedeblokkeerdeMelding>
				</brp:gedeblokkeerdeMeldingen>
				<brp:bronnen>
					<brp:bron brp:objecttype="ActieBron" brp:communicatieID="${DataSource Values#comid.bron1}">
						<brp:document brp:communicatieID="Document1" brp:objecttype="Document">
							<brp:soortNaam>${DataSource Values#soortNaam_dbs0}</brp:soortNaam>
							<brp:identificatie>${DataSource Values#identificatie_dbs0}</brp:identificatie>
							<brp:aktenummer>${DataSource Values#aktenummer_dbs0}</brp:aktenummer>
							<brp:partijCode>${DataSource Values#partijCode_dbs0}</brp:partijCode>
						</brp:document>
					</brp:bron>
				</brp:bronnen>
				<brp:acties>
					<brp:registratieAanvangHuwelijkGeregistreerdPartnerschap brp:communicatieID="id.regAanvangHuwelijkPartnerschap0" brp:objecttype="Actie">
						<brp:datumAanvangGeldigheid>${DataSource Values#datumAanvangGeldigheid_ras0}</brp:datumAanvangGeldigheid>
						<brp:bronnen>
							<brp:bron brp:communicatieID="BronDocument1"
								  brp:referentieID="${DataSource Values#refid.brondocument1}"
								  brp:objecttype="ActieBron">
							</brp:bron>
						</brp:bronnen>
						<brp:huwelijk brp:communicatieID="id.relatie0" brp:objecttype="Relatie">
							<brp:relatie brp:communicatieID="id.relatie1">
								<brp:datumAanvang>${DataSource Values#datumAanvang_hra0}</brp:datumAanvang>
								<brp:gemeenteAanvangCode>${DataSource Values#gemeenteAanvangCode_hra0}</brp:gemeenteAanvangCode>
								<brp:woonplaatsnaamAanvang>${DataSource Values#woonplaatsnaamAanvang_hra0}</brp:woonplaatsnaamAanvang>
							</brp:relatie>
							<brp:betrokkenheden>
								<brp:partner brp:communicatieID="id.partner0" brp:objecttype="Betrokkenheid">
									<brp:persoon brp:communicatieID="id.persoon0" brp:objecttype="Persoon"
                                       brp:objectSleutel="${DataSource Values#burgerservicenummer_ipp0}">
										<brp:soortCode>${DataSource Values#soortCode_ppb0}</brp:soortCode>
										<brp:identificatienummers brp:communicatieID="id.identificatienummers0" brp:objectSleutel="?">
											<brp:administratienummer>${DataSource Values#administratienummer_ipp0}</brp:administratienummer>
										</brp:identificatienummers>
										<brp:samengesteldeNaam brp:communicatieID="id.samengesteldeNaam0">
											<brp:indicatieNamenreeks>${DataSource Values#indicatieNamenreeks_spp0}</brp:indicatieNamenreeks>
											<brp:predicaatCode>${DataSource Values#predicaatCode_spp0}</brp:predicaatCode>
											<brp:voornamen>${DataSource Values#voornamen_spp0}</brp:voornamen>
											<brp:adellijkeTitelCode>${DataSource Values#adellijkeTitelCode_spp0}</brp:adellijkeTitelCode>
											<brp:voorvoegsel>${DataSource Values#voorvoegsel_spp0}</brp:voorvoegsel>
											<brp:scheidingsteken>${DataSource Values#scheidingsteken_spp0}</brp:scheidingsteken>
											<brp:geslachtsnaamstam>${DataSource Values#geslachtsnaamstam_spp0}</brp:geslachtsnaamstam>
										</brp:samengesteldeNaam>
										<brp:geboorte brp:communicatieID="id.geboorte0">
											<brp:datum>${DataSource Values#datum_gpp0}</brp:datum>
											<brp:gemeenteCode>${DataSource Values#gemeenteCode_gpp0}</brp:gemeenteCode>
											<brp:woonplaatsnaam>${DataSource Values#woonplaatsnaam_gpp0}</brp:woonplaatsnaam>
											<brp:buitenlandsePlaats>${DataSource Values#buitenlandsePlaats_gpp0}</brp:buitenlandsePlaats>
											<brp:buitenlandseRegio>${DataSource Values#buitenlandseRegio_gpp0}</brp:buitenlandseRegio>
											<brp:omschrijvingLocatie>${DataSource Values#omschrijvingLocatie_gpp0}</brp:omschrijvingLocatie>
											<brp:landGebiedCode>${DataSource Values#landGebiedCode_gpp0}</brp:landGebiedCode>
										</brp:geboorte>
										<brp:geslachtsaanduiding brp:communicatieID="id.geslachtsaanduiding0">
											<brp:code>${DataSource Values#code_gpp0}</brp:code>
										</brp:geslachtsaanduiding>
										<brp:geslachtsnaamcomponenten>
											<brp:geslachtsnaamcomponent brp:communicatieID="id.geslachtsnaamcomponent1"
                                                             brp:objecttype="PersoonGeslachtsnaamcomponent">
												<brp:predicaatCode>${DataSource Values#predicaatCode_ggp1}</brp:predicaatCode>
												<brp:adellijkeTitelCode>${DataSource Values#adellijkeTitelCode_ggp1}</brp:adellijkeTitelCode>
												<brp:voorvoegsel>${DataSource Values#voorvoegsel_ggp1}</brp:voorvoegsel>
												<brp:scheidingsteken>${DataSource Values#scheidingsteken_ggp1}</brp:scheidingsteken>
												<brp:stam>${DataSource Values#naam_ggp1}</brp:stam>
											</brp:geslachtsnaamcomponent>
										</brp:geslachtsnaamcomponenten>
									</brp:persoon>
								</brp:partner>
								<brp:partner brp:communicatieID="id.partner1" brp:objecttype="Betrokkenheid">
									<brp:persoon brp:communicatieID="id.persoon1" brp:objecttype="Persoon"
                                       brp:objectSleutel="${DataSource Values#burgerservicenummer_ipp1}">
										<brp:soortCode>${DataSource Values#soortCode_ppb1}</brp:soortCode>
										<brp:identificatienummers brp:communicatieID="id.identificatienummers1" brp:objectSleutel="?">
											<brp:administratienummer>${DataSource Values#administratienummer_ipp1}</brp:administratienummer>
										</brp:identificatienummers>
										<brp:samengesteldeNaam brp:communicatieID="id.samengesteldeNaam1">
											<brp:indicatieNamenreeks>${DataSource Values#indicatieNamenreeks_spp1}</brp:indicatieNamenreeks>
											<brp:predicaatCode>${DataSource Values#predicaatCode_spp1}</brp:predicaatCode>
											<brp:voornamen>${DataSource Values#voornamen_spp1}</brp:voornamen>
											<brp:adellijkeTitelCode>${DataSource Values#adellijkeTitelCode_spp1}</brp:adellijkeTitelCode>
											<brp:voorvoegsel>${DataSource Values#voorvoegsel_spp1}</brp:voorvoegsel>
											<brp:scheidingsteken>${DataSource Values#scheidingsteken_spp1}</brp:scheidingsteken>
											<brp:geslachtsnaamstam>${DataSource Values#geslachtsnaamstam_spp1}</brp:geslachtsnaamstam>
										</brp:samengesteldeNaam>
										<brp:geboorte brp:communicatieID="id.geboorte1">
											<brp:datum>${DataSource Values#datum_gpp1}</brp:datum>
											<brp:gemeenteCode>${DataSource Values#gemeenteCode_gpp1}</brp:gemeenteCode>
											<brp:woonplaatsnaam>${DataSource Values#woonplaatsnaam_gpp1}</brp:woonplaatsnaam>
											<brp:buitenlandsePlaats>${DataSource Values#buitenlandsePlaats_gpp1}</brp:buitenlandsePlaats>
											<brp:buitenlandseRegio>${DataSource Values#buitenlandseRegio_gpp1}</brp:buitenlandseRegio>
											<brp:omschrijvingLocatie>${DataSource Values#omschrijvingLocatie_gpp1}</brp:omschrijvingLocatie>
											<brp:landGebiedCode>${DataSource Values#landGebiedCode_gpp1}</brp:landGebiedCode>
										</brp:geboorte>
										<brp:geslachtsaanduiding brp:communicatieID="id.geslachtsaanduiding1">
											<brp:code>${DataSource Values#code_gpp1}</brp:code>
										</brp:geslachtsaanduiding>
										<brp:geslachtsnaamcomponenten>
											<brp:geslachtsnaamcomponent brp:communicatieID="id.geslachtsnaamcomponent2"
                                                             brp:objecttype="PersoonGeslachtsnaamcomponent">
												<brp:predicaatCode>${DataSource Values#predicaatCode_ggp2}</brp:predicaatCode>
												<brp:adellijkeTitelCode>${DataSource Values#adellijkeTitelCode_ggp2}</brp:adellijkeTitelCode>
												<brp:voorvoegsel>${DataSource Values#voorvoegsel_ggp2}</brp:voorvoegsel>
												<brp:scheidingsteken>${DataSource Values#scheidingsteken_ggp2}</brp:scheidingsteken>
												<brp:stam>${DataSource Values#naam_ggp2}</brp:stam>
											</brp:geslachtsnaamcomponent>
										</brp:geslachtsnaamcomponenten>
									</brp:persoon>
								</brp:partner>
							</brp:betrokkenheden>
						</brp:huwelijk>
					</brp:registratieAanvangHuwelijkGeregistreerdPartnerschap>
					<brp:registratieNaamgebruik brp:communicatieID="id.registratieNaamgebruik0" brp:objecttype="Actie">
						<brp:datumAanvangGeldigheid>${DataSource Values#datumAanvangGeldigheid_ras1}</brp:datumAanvangGeldigheid>
						<brp:bronnen>
							<brp:bron brp:communicatieID="BronDocument2"
								  brp:referentieID="${DataSource Values#refid.brondocument2}"
								  brp:objecttype="ActieBron">
							</brp:bron>
						</brp:bronnen>
						<brp:persoon brp:communicatieID="id.persoon2" brp:objecttype="Persoon"
                              brp:objectSleutel="${DataSource Values#burgerservicenummer_ipp2}">
							<brp:naamgebruik brp:communicatieID="id.naamgebruik0">
								<brp:code>${DataSource Values#code_apr0}</brp:code>
								<brp:indicatieAfgeleid>${DataSource Values#indicatieAfgeleid_apr0}</brp:indicatieAfgeleid>
								<brp:predicaatCode>${DataSource Values#predicaatCode_apr0}</brp:predicaatCode>
								<brp:voornamen>${DataSource Values#voornamen_apr0}</brp:voornamen>
								<brp:adellijkeTitelCode>${DataSource Values#adellijkeTitelCode_apr0}</brp:adellijkeTitelCode>
								<brp:voorvoegsel>${DataSource Values#voorvoegsel_apr0}</brp:voorvoegsel>
								<brp:scheidingsteken>${DataSource Values#scheidingsteken_apr0}</brp:scheidingsteken>
								<brp:geslachtsnaamstam>${DataSource Values#geslachtsnaamstam_apr0}</brp:geslachtsnaamstam>
							</brp:naamgebruik>
						</brp:persoon>
					</brp:registratieNaamgebruik>
				</brp:acties>
			</brp:voltrekkingHuwelijkInNederland>
		</brp:bhg_hgpRegistreerHuwelijkGeregistreerdPartnerschap>
	</soapenv:Body>
</soapenv:Envelope>
